<template>
    <div>
        <h1 class="th1">写在前面</h1>
        <p class="tp">本项目为个人项目,主要为解决日常开发的重复工作,并记录组件使用方法,整体无风格。其中包含常用的方法以及电商常用的组件。此组件愿景是减少重复工作并且可高度定制，以适应不同的设计风格。</p>
        <h2 class="th2">无风格</h2>
        <p class="tp">
            整体组件没有明确成套的设计风格，实际项目中也多是需要按照设计稿改造样式，所以样式都是我随性写的(也可以说我懒)
        </p>
        <h2 class="th2">可塑性</h2>
        <p class="tp">
            多数组件只提供最核心部分，以保证组件的可塑性。故不适合原型开发等速成的项目。
        </p>
        <h2 class="th2">为什么要造轮子？</h2>
        <p class="tp">
            市面上太多造好的轮子了，而且有些也是十分优秀的。由于项目基本上都是UI设计师设计好的，所以直接用现有的知名框架改起来麻烦，并且多数写法也比较晦涩难懂。
            一些小的个人项目又不敢使用，于是乎就打算自己写一套。本框架包含的多是些主流框架里没有，或者是重写为符合自身项目需求,比较麻烦的组件。
        </p>
        <h2 class="th2">这是个人项目</h2>
        <p class="tp">
            因为是为了满足自己日常所需，怕忘记自己组件的使用方法，也为了方便同事使用，才有造此框架的念头，方方面面可能都比不过大厂的框架，但可能胜在简单（源码很好理解- -）
        </p>
    </div>
</template>

<script>
    export default {
        data() {
            return {}
        }
    }
</script>

<style scoped>
    h2{
        margin-top: 60px;
    }
</style>